import random

hot = ['火鍋','麵','羊肉爐','拉麵']
salt = ['飯','麵','便當','魯肉飯','串燒']
sweet = ['豆花','冰店','蛋糕','甜點']
spicy = ['麻辣','酸辣粉','鴨血臭豆腐','螺獅粉']
sour = ['泰式']
ice = ['豆花','冰店','飲料']
crispy = ['炸雞','麥當勞','肯德基']

def likelyTaste(str):
    if(str == '熱'):
        taste = hot
    elif(str == '鹹'):
        taste = salt
    elif(str == '甜'):
        taste = sweet
    elif(str == '辣'):
        taste = spicy
    elif(str == '酸'):
        taste = sour
    elif(str == '冰'):
        taste = ice
    elif(str == '炸'):
        taste = crispy

    return random.choice(taste)

food = [
"牛肉麵",
"義大利麵",
"壽司",
"丼飯",
"鍋燒麵",
"便當",
"包子",
"湯包",
"鍋貼",
"水餃",
"燒烤",
"串燒",
"燒肉",
"早餐店",
"鹹酥雞",
"咖哩飯",
"咖哩",
"炸雞",
"飲料",
"牛排",
"韓式",
"日式",
"火鍋",
"麵線",
"豬腳",
"早午餐",
"披薩",
"漢堡",
"素食",
"速食",
"湯",
"燒烤",
"串燒",
"臭豆腐",
"鴨血",
"麵",
"飯",
"鐵板燒",
"滷味",
"鹹水雞",
"小籠包",
"下午茶",
"泰式",
"日式",
"羊肉爐",
"涼麵",
"雞肉飯",
"素食",
"速食",
"麥當勞",
"肯德基",
"摩斯",
"滷肉飯",
"雞魯飯",
"魯肉飯",
"雞滷飯",
"手搖飲",
"豆花",
"冰店",
"蛋糕",
"甜點",
"麻辣",
"酸辣粉",
"螺獅粉",
"鴨血臭豆腐"]

def randomRestaurant():
    return random.choice(food)